Revit 2024 API
BuiltInFailures.StairRampFailures.RiserIntWithBoundaryMoreThanOnceFailure Property
 Riser intersects with boundary more than once.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId RiserIntWithBoundaryMoreThanOnceFailure { get; }
Visual Basic
Public Shared ReadOnly Property RiserIntWithBoundaryMoreThanOnceFailure As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ RiserIntWithBoundaryMoreThanOnceFailure {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace